experiments/02_heartbeat_laminar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;

// Run for 3 complete cardiac cycles (T = 0.857 s → 3T ≈ 2.571 s).
// Periodic steady state is typically reached after the first cycle;
// the remaining cycles are used for analysis.
endTime         2.571;

// deltaT = 0.002 s  →  CFL = U_center_peak * dt / dx
//        = 0.5 * 0.002 / 0.0025  (dx = L/40 = 0.1/40)
//        = 0.4  (< 1 ✓)
deltaT          0.002;

writeControl    runTime;
// Save 20 snapshots per cardiac cycle (0.857 / 0.04 ≈ 21 frames/cycle)
writeInterval   0.04;

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
